Left/esp8266_wifi_clock/sceleton.h
#pragma once

#include <Arduino.h>
#include <FS.h>
#include <ArduinoJson.h>
#include <ESP8266WiFi.h>
#include <WebSockets.h>
#include <WebSocketsClient.h>
#include <ESPAsyncWebServer.h>
// #include <ArduinoOTA.h>

// #define ESP01

// #ifdef ESP01
static const uint8_t D0   = 16;
static const uint8_t D1   = 5;
static const uint8_t D2   = 4;
static const uint8_t D3   = 0;
static const uint8_t D4   = 2;
static const uint8_t D5   = 14;
static const uint8_t D6   = 12;
static const uint8_t D7   = 13;
static const uint8_t D8   = 15;
static const uint8_t D9   = 3;
static const uint8_t D10  = 1;
// #endif

Stream* debugSerial;

void debugPrint(const String& str);

namespace sceleton {

class Sink {
public:
    virtual void showMessage(const char* s, int totalMsToShow) {}
    virtual void showTuningMsg(const char* s) {}
    virtual void setAdditionalInfo(const char* s) {}
    virtual void switchRelay(uint32_t id, bool val) {}
    virtual boolean relayState(uint32_t id) { return false; } 
    virtual void setBrightness(int percents) {}
    virtual void setTime(uint32_t unixTime) {}
    virtual void setLedStripe(std::vector<uint32_t> colors) {}
    virtual const std::vector<uint32_t>& getLedStripe() {}
    virtual void setD0PWM(uint32_t val) {}
    virtual void playMp3(uint32_t index) {}
    virtual void reboot() {}
    virtual void enableScreen(const boolean enabled) {}
    virtual boolean screenEnabled() { return false; }
};

String fileToString(const String& fileName) {
    if (SPIFFS.exists(fileName.c_str())) {
        File f = SPIFFS.open(fileName.c_str(), "r");
        debugSerial->println(f.size());
        std::vector<uint8_t> buf(f.size() + 1, 0);
        if (f && f.size()) {
        f.read((uint8_t*)(&buf[0]), buf.size());
        }
        f.close();
        return String((const char*)(&buf[0]));
    }
    return String();
}

const String typeKey("type");

const char* firmwareVersion = "00.22";

std::auto_ptr<AsyncWebServer> setupServer;
std::auto_ptr<WebSocketsClient> webSocketClient;

long vccVal = 0;
long rebootAt = 0x7FFFFFFF;

void send(const String& toSend) {
    webSocketClient->sendTXT(toSend.c_str(), toSend.length());
}

class DevParam {
public:
    const char* _name;
    const char* _jsonName;
    const char* _description;
    String _value;
    boolean _password;

    DevParam(const char* name, const char* jsonName, const char* description, String value, boolean pwd=false) :
        _name(name),
        _jsonName(jsonName),
        _description(description),
        _value(value),
        _password(pwd) {
    }
};

DevParam deviceName("device.name", "name", "Device Name", String("ESP_") + ESP.getChipId());
DevParam deviceNameRussian("device.name.russian", "rname", "Device Name (russian)", String("ESP_") + ESP.getChipId());
DevParam wifiName("wifi.name", "wifi", "WiFi SSID", "YYYY");
DevParam wifiPwd("wifi.pwd", "wfpwd", "WiFi Password", "XXXX", true);
DevParam logToHardwareSerial("debug.to.serial", "debugserial", "Print debug to serial", "true");
DevParam websocketServer("websocket.server", "ws", "WebSocket server", "192.168.121.38");
DevParam websocketPort("websocket.port", "wsport", "WebSocket port", "8080");
#ifndef ESP01
DevParam invertRelayControl("invertRelay", "invrelay", "Invert relays", "false");
DevParam hasScreen("hasScreen", "screen", "Has screen", "false");
DevParam hasScreen180Rotated("hasScreen180Rotated", "screen180", "Screen is rotated on 180", "false");
DevParam hasHX711("hasHX711", "hx711", "Has HX711 (weight detector)", "false");
DevParam hasIrReceiver("hasIrReceiver", "ir", "Has infrared receiver", "false");
DevParam hasDS18B20("hasDS18B20", "ds18b20", "Has DS18B20 (temp sensor)", "false");
DevParam hasDFPlayer("hasDFPlayer", "dfplayer", "Has DF player", "false");
#endif
DevParam hasBME280("hasBME280", "bme280", "Has BME280 (temp & humidity sensor)", "false");
DevParam hasLedStripe("hasLedStripe", "ledstrip", "Has RGBW Led stripe", "false");
#ifndef ESP01
DevParam hasButton("hasButton", "d7btn", "Has button on D7", "false");
DevParam brightness("brightness", "bright", "Brightness [0..100]", "0");
DevParam hasEncoders("hasEncoders", "enc", "Has encoders", "false");
DevParam hasMsp430("hasMsp430WithEncoders", "msp430", "Has MSP430 with encoders", "false");
DevParam hasPotenciometer("hasPotenciometer", "potent", "Has potenciometer", "false");
DevParam hasSolidStateRelay("hasSSR", "ssr", "Has Solid State Relay (D1, D2, D5, D6)", "false");
#endif
DevParam relayNames("relay.names", "relays", "Relay names, separated by ;", "");
DevParam hasGPIO1Relay("hasGPIO1Relay", "gpio1relay", "Has GPIO1 Relay", "false");
DevParam hasPWMOnD0("hasPWMOnD0", "pwmOnD0", "Has PWM on D0", "false");
DevParam secondsBeforeRestart("secondsBeforeRestart", "watchdog", "Seconds before restart", "60000");

uint32_t msBeforeRestart = atoi(secondsBeforeRestart._value.c_str());

DevParam* devParams[] = { 
    &deviceName, 
    &deviceNameRussian,
    &wifiName, 
    &wifiPwd, 
    &logToHardwareSerial,
    &websocketServer, 
    &websocketPort, 
#ifndef ESP01
    &invertRelayControl, 
    &hasScreen, 
    &hasScreen180Rotated,
    &hasHX711,
    &hasIrReceiver,
    &hasDS18B20,
    &hasDFPlayer,
#endif
    &hasBME280,
    &hasLedStripe,
#ifndef ESP01
    &hasEncoders,
    &hasButton, 
    &brightness,
    &hasMsp430,
#endif
    &relayNames,
    &hasGPIO1Relay,
#ifndef ESP01
    &hasPotenciometer,
    &hasSolidStateRelay,
#endif
    &hasPWMOnD0,
    &secondsBeforeRestart
}; 
Sink* sink = new Sink();
boolean initializedWiFi = false;
uint32_t lastReceived = millis();
uint32_t reconnectWebsocketAt = 0x7FFFFFFF; // Never by def
uint32_t reportedGoingToReconnect = millis();

void reportRelayState(uint32_t id) {
    send("{ \"type\": \"relayState\", \"id\": " + String(id, DEC) + ", \"value\":" + (sink->relayState(id) ? "true" : "false") + " }");
}

void onDisconnect(const WiFiEventStationModeDisconnected& event) {
    // debugSerial->println("WiFi On Disconnect.");
    // debugSerial->println(event.reason);
}

