Left/esp8266_wifi_clock/sceleton.h
    if (WiFi.status() != WL_CONNECTED && (millis() > nextReconnect)) {
        debugSerial->println(String("WiFi.status() check: ") + WiFi.status());
        bool ret = WiFi.reconnect();
        debugSerial->println(String("Reconnect returned ") + String(ret, DEC));
        nextReconnect = millis() + (ret ? 4000 : 300);
    }

    if (millis() > nextWiFiScan) {
        WiFi.scanNetworks(true);

        nextWiFiScan = millis() + 10000; // Scan every 4 seconds
    }

    int n = WiFi.scanComplete();
    if(n >= 0) {
        debugSerial->printf("%d network(s) found\n", n);
        for (int i = 0; i < n; i++) {
            debugSerial->printf("%d: %s, Ch:%d (%ddBm) %s\n", i+1, WiFi.SSID(i).c_str(), WiFi.channel(i), WiFi.RSSI(i), WiFi.encryptionType(i) == ENC_TYPE_NONE ? "open" : "");
        }
        WiFi.scanDelete();
    }

    if (oldStatus != WiFi.status()) {
        oldStatus = WiFi.status();
        debugSerial->println(String("WiFi.status(): ") + WiFi.status());

        if (WiFi.status() == WL_IDLE_STATUS || WiFi.status() == WL_DISCONNECTED) {
            long l = millis();
            debugSerial->println("Reconnecting");
            reconnectWebsocketAt = 0x7FFFFFFF;
            WiFi.reconnect();
        }

        if (WiFi.status() == WL_CONNECTED) {
            debugSerial->println(String("Connected to WiFi, IP:") + WiFi.localIP().toString());
            reconnectWebsocketAt = millis() + 1000; // Wait 1000 ms and connect to websocket
            // ArduinoOTA.begin(); // Begin OTA immediately
            initializedWiFi = true;
        }
    }

    if (millis() >= reconnectWebsocketAt) {
        if (webSocketClient.get() != NULL) {
            debugSerial->println(String("webSocketClient connecting to ") + websocketServer._value.c_str());
            webSocketClient->disconnect();
            uint32_t ms = millis();
            webSocketClient->begin(websocketServer._value.c_str(), websocketPort._value.toInt(), "/esp");
            debugSerial->println(String("webSocketClient.begin() took " + String(millis() - ms, DEC)));
            reconnectWebsocketAt = millis() + 8000; // 8 seconds should be enough to cennect WS
        }
    }

    if (initializedWiFi) {
        if (webSocketClient.get() != NULL) {
            uint32_t ms = millis();
            webSocketClient->loop();
            if ((millis() - ms) > 50) {
                debugSerial->println(String("webSocketClient.loop() took " + String(millis() - ms, DEC)));
            }
        }
    }

#ifndef ESP01
/*
    if (millis() / 1000 != lastEachSecond) {
        lastEachSecond = millis() / 1000;
        // Set brightness if saved
        if (sceleton::hasScreen._value == "true") {
            sink->setBrightness(brightness._value.toInt());
        }
        // vccVal = ESP.getVcc();
    }
*/
#endif

    if (initializedWiFi) {
        if (millis() - lastReceived > msBeforeRestart) {
            //debugSerial->println("Rebooting...");
            if (reportedGoingToReconnect <= lastReceived) {
                sink->showMessage((String(msBeforeRestart / 1000, DEC) + " секунд без связи с сервером, перезагружаемся").c_str(), 3000);
                debugSerial->println(String(msBeforeRestart / 1000, DEC) + " seconds w/o connect to server");
                reportedGoingToReconnect = millis();
            }

            rebootAt = millis();
        }

        if (rebootAt <= millis()) {
            sink->reboot();
        }
    }

    if (saveBrightnessAt < millis()) {
        saveSettings();
        saveBrightnessAt = 0x7FFFFFFF;
    }
/*
    if (millis() % 1000 == 0) {
        debugSerial->println("Heap size: " + String(ESP.getFreeHeap(), DEC) + " bytes");
    }
*/
}

} // namespace

void debugPrint(const String& str) {
    if (sceleton::webSocketClient.get() != NULL) {
        String toSend;
        toSend = "{ \"type\": \"log\", \"val\": \"" + str + "\" }";

        sceleton::send(toSend);
    }
}
